tutorials/cases/simple_line_case/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           off;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

chemistrySolver     ode;

solidChemistrySolver	solidOde;

initialChemicalTimeStep 1e-1;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;

solidChemistryTimeStepControl true;

odeCoeffs
{
    solver          seulex;
}

solidOdeCoeffs
{
    //solver      seulex; //old solver

    //   Runge-Kutta solver
    // RKF45 uses the actual derivatives directly and does not rely on that Jacobian.
    solver      RKF45;

    // The OpenFOAM default absolute tolerance is SMALL, which is too
    // restrictive for product species that initially have zero
    // concentration.
    absTol      1e-8;

    //  normal relative accuracy used by OpenFOAM ODE solvers
    relTol      1e-4;
    maxSteps    10000;
}

species
(
    targas gas N2 //H2O
);

solidReactions
(
  //  irreversibleSolidArrheniusHeterogeneousReaction
  //  hum = H2O
   // (1.36e1 2.9e3 301  2.256e6 1)

    irreversibleSolidArrheniusHeterogeneousReaction
    wood = targas 
    (2.0e10 1.78e4 300 1.10e5 1)  

    irreversibleSolidArrheniusHeterogeneousReaction
    wood = char1
    (2.51e7 1.4e4 300 0e5 1) 
    
    irreversibleSolidArrheniusHeterogeneousReaction
    char1 = 0.65 char + 0.35 gas
    (1.38e10 1.9e4 300 -2.1e5 1)
);


// ************************************************************************* //


