tutorials/cases/simple_line_case/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 900;


boundaryField
{
    wall
    {
        type            uniformFixedValue;

        uniformValue    table
        (
            (0          300)
            (60          300)
            (60.1   900)
            (1000000    900)
        );

        //value           uniform 900;
    }

    inlet
    {
        type            uniformFixedValue;

        uniformValue    table
        (
            (0          300)
            (60          300)
            (60.1   900)
            (1000000    900)
        );

        //value           uniform 900;
    }

    outlet
    {
        type            zeroGradient;
    }
}


/*

    wall
    {
        type            fixedValue;
        value           uniform 900;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 900;
    }

    outlet
    {
        type            zeroGradient;
    }


*/


// ************************************************************************* //
