tutorials/cases/simple_line_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           1e-2;
    }

    pFinal
    {
        $p;
        relTol           0.0;
    }


    "(U|h|Yi|Ys|Ym|porosity)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(U|h|Yi|Ys|Ym|porosity)Final"
    {
        $U;
        relTol      0;
    }   


    // The solid energy matrix is symmetric, so it takes a symmetric solver
    // and preconditioner - PBiCGStab/DILU aborts on it.
    Ts
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          1e-6;
        maxIter         1000;
    }

    rhos
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    G
    {
        $p;
        tolerance       1e-05;
        relTol          1e-2;
    }

    GFinal
    {
        $G;
        relTol          0;
    }


"(Us|UsDEMInterpolation)"
{
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-6;
    relTol          0.01;
}

// "(UsDEMInterpolation)"
// {
//     solver          smoothSolver;
//     smoother        symGaussSeidel;
//     tolerance       1e-10;
//     relTol          0;
//     maxIter     1000;

// }
 solidH
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           1e-7;
    }

}


PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0; // 
}


relaxationFactors
{

    //  equations
    // {
    //     Ts 0.2;
    //      solidH   0.2;
    //     h  0.7;
    // }
}

// *************************************************************************//

