tutorials/cases/simple_line_case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    // Reset the complete domain before defining the new things
    volScalarFieldValue porosityF  1
    volScalarFieldValue porosityF0 1
    volScalarFieldValue Ts         0
);


regions
(
    boxToCell
    {
        //box (-0.0051 -0.0051 -0.0101) (0.0051 0.0051 0.0101);

        box (-0.000953 -0.000953 -0.008572)
            ( 0.000953  0.000953  0.008572);
        fieldValues
        (
            volScalarFieldValue porosityF 0.5
            volScalarFieldValue porosityF0 0.5
            volScalarFieldValue Ts 500
        );
    }
);



// ************************************************************************* //
