tutorials/cases/simple_line_case/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions
# Requires a Yade-enabled solver build: ./build.sh --yade

restore0Dir
runApplication blockMesh
runApplication setFields
runApplication decomposePar
mkdir -p spheres springs
# Solver runs inside Yade via the MPI coupling script — not a standard runParallel,
# so it is launched directly here (output captured to log.yade).
mpirun --allow-run-as-root -n 2 yade yade.py 2>&1 | tee log.yade
